/**
 * Создать строку,состоящую из чисел от 0 до 20000.
 * Важно понимать,что это одна строка, полученная конкатенацией(склеиванием)
 * чисел из диапазона через пробел(0 + " " + 1 + " " + 2 + ... + 20000)
 * После создания такой строки, вызов System.out.println() на этой строке должен вывести в консоль
 * сразу все числа из диапазона:
 * 0 1 2 3 4 5 6 7 8 9 10 11 12 ...199999 20000
 *
 * Для того , чтобы почувствовать разницу в производительности между конкатенацией обычных строк(класс String)
 * и использования Stringbilder, реализуйте описанную задачу этими двумя способами
 * замеряя время работы программы.
 */

public class Main {
    public static void main(String[] args) {
        System.out.println("Hello world!");
    }
}