/**
 * Реализовать программу, которая принимает на вход через консоль с помощью класса Scanner
 * число соответсвующее количеству этажей в здании.
 * Используя ксловный оператор if , неободимо вывести в консоль сообщение о типе такого дома.
 * Условия: 1-4 - Малоэтажный дом, 5-8 - Среднеэтажный дом, 9 и более -Многоэтажный дом.
 * Так же , необходимо учесть что может быть отрицательное значение - некорректный ввод.
 */

public class Main {
    public static void main(String[] args) {
        int floor;
    }
}